Revit 2027 API
MEPAnalyticalModelData.GetSegmentData Method
 Gets the analysis data on the specified segment.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPNetworkSegmentData GetSegmentData(
	int segmentId
)
Public Function GetSegmentData (
	segmentId As Integer
) As MEPNetworkSegmentData
public:
MEPNetworkSegmentData^ GetSegmentData(
	int segmentId
)
member GetSegmentData :
        segmentId : int -> MEPNetworkSegmentData
Parameters
segmentId Int32
 The segment id to be retrieved.
Return Value
MEPNetworkSegmentData
 The calculated data of this segment. Be aware that the segment data may be invalid if the calculation failed.
Exceptions
Exception | Condition
ArgumentException |  The input must be a valid segment id.
See Also
Reference
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace